#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

#### Preview environment 🔗
[[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mNo outputs found[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe state file either has no outputs defined, or all the defined outputs
[33m│[0m [0mare empty. Please define an output in your configuration with the `output`
[33m│[0m [0mkeyword and run `terraform refresh` for it to become available. If you are
[33m│[0m [0musing interpolation, please verify the interpolated value is not empty. You
[33m│[0m [0mcan use the `terraform console` command to assist.
[33m╵[0m[0m
]([33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mNo outputs found[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe state file either has no outputs defined, or all the defined outputs
[33m│[0m [0mare empty. Please define an output in your configuration with the `output`
[33m│[0m [0mkeyword and run `terraform refresh` for it to become available. If you are
[33m│[0m [0musing interpolation, please verify the interpolated value is not empty. You
[33m│[0m [0mcan use the `terraform console` command to assist.
[33m╵[0m[0m
)

<details><summary>Show plan for apply after merge to master</summary>

```hcl

terraform
Acquiring state lock. This may take a few moments...
module.aws-deploy.random_string.suffix: Refreshing state... [id=dODhfcMeawSZvlaI8JpSx77BgF6FxBoA]
module.aws-deploy.aws_ecs_task_definition.main: Refreshing state... [id=bekk-arrangement-app-dev]
module.aws-deploy.aws_route53_record.main[0]: Refreshing state... [id=Z04411953P8CDQG39NSHW_skjer.bekk.dev_A]
module.aws-deploy.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/dev-dODhfcMeawSZvlaI8JpSx77BgF6/031a81946e3bbd97]
module.aws-deploy.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-app-dev]
module.aws-deploy.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:listener-rule/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f/da09c5a7670ad5a8/a7f814de828e135c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws-deploy.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-app-dev"
        name                               = "bekk-arrangement-app-dev"
      ~ tags                               = {
          + "Terraform" = "true"
        }
      ~ tags_all                           = {
          + "Terraform" = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-app-dev:2" -> (known after apply)
        # (13 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.aws-deploy.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-app-dev:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "882089634282.dkr.ecr.eu-central-1.amazonaws.com/arrangement-app:46" -> "882089634282.dkr.ecr.eu-central-1.amazonaws.com/bekk-arrangement-app:latest"
                  ~ logConfiguration = {
                      ~ logDriver = "awslogs" -> "awsfirelens"
                      ~ options   = {
                          + Name                  = "firehose"
                          - awslogs-group         = "bekk-ecs-dev" -> null
                          - awslogs-region        = "eu-central-1" -> null
                          - awslogs-stream-prefix = "fargate" -> null
                          + delivery_stream       = "bekk-firehose-logs"
                          + region                = "eu-central-1"
                          + retry_limit           = "2"
                        }
                    }
                    name             = "bekk-arrangement-app-dev"
                    # (7 unchanged elements hidden)
                } # forces replacement,
              + {
                  + essential             = true
                  + firelensConfiguration = {
                      + options = {
                          + enable-ecs-log-metadata = "true"
                        }
                      + type    = "fluentbit"
                    }
                  + image                 = "amazon/aws-for-fluent-bit"
                  + logConfiguration      = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "firelens-container"
                          + awslogs-region        = "eu-central-1"
                          + awslogs-stream-prefix = "firelens"
                        }
                    }
                  + name                  = "log_router"
                },
            ]
        )
      ~ execution_role_arn       = "arn:aws:iam::882089634282:role/bekk-ecsTaskExecutionRole" -> "arn:aws:iam::882089634282:role/bekk-ecsTaskExecutionRole-dev" # forces replacement
      ~ id                       = "bekk-arrangement-app-dev" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "Name"      = "bekk-arrangement-app-dev"
            "Terraform" = "true"
        }
      ~ task_role_arn            = "arn:aws:iam::882089634282:role/bekk-ecsTaskRole" -> "arn:aws:iam::882089634282:role/bekk-ecsTaskRole-dev" # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @omaen, Action: `pull_request`*